
export type Event = {
  id: string;
  title: string;
  date: string;
  description: string;
  image: string;
  imageHint: string;
};

export type Member = {
  id: string;
  name: string;
  role: string;
  imageUrl: string;
  imageHint: string;
};

export type ExecutiveMember = {
    name: string;
    role: string;
}

export const events: Event[] = [
  {
    id: "1",
    title: "वार्षिक कीर्तन महोत्सव",
    date: "२० ऑगस्ट, २०२४",
    description: "प्रसिद्ध कीर्तनकारांच्या उपस्थितीत भव्य कीर्तन सोहळा.",
    image: "/images/temple-3d-model.jpeg",
    imageHint: "devotional singing"
  },
  {
    id: "2",
    title: "नवरात्री उत्सव",
    date: "३ ऑक्टोबर - १२ ऑक्टोबर, २०२४",
    description: "नऊ दिवसांचा भव्य नवरात्री उत्सव, दररोज विविध धार्मिक कार्यक्रम.",
    image: "/images/plan.png",
    imageHint: "navratri festival"
  },
  {
    id: "3",
    title: "महाप्रसाद",
    date: "प्रत्येक शनिवारी",
    description: "दर शनिवारी संध्याकाळी आरतीनंतर महाप्रसादाचे आयोजन.",
    image: "/images/temple-3d-model.jpeg",
    imageHint: "community meal"
  },
  {
    id: "4",
    title: "भूमिपूजन समारंभ",
    date: "२५ डिसेंबर, २०२४",
    description: "मंदिराच्या जिर्णोद्धार कार्याचा शुभारंभ, भूमिपूजन समारंभ.",
    image: "/images/plan.png",
    imageHint: "groundbreaking ceremony"
  },
];


export const executiveCommittee: ExecutiveMember[] = [
    { role: "संचालक", name: "विजय कदम"},
    { role: "अध्यक्ष", name: "बबन आमले"},
    { role: "उपाध्यक्ष", name: "सिताराम तानवडे"},
    { role: "सेक्रेटरी", name: "किरण सातोपे"},
    { role: "उपसेक्रेटरी", name: "अविनाश सातोपे"},
    { role: "खजिनदार", name: "पांडुरंग नाडणकर"},
    { role: "उपखजिनदार", name: "सुशील गांवकर"},
]

export const members: string[] = [
    "ओंकार बारस्कर",
    "सागर सुखदरे",
    "विठोबा नाडणकर",
    "प्रमोद पाते",
    "प्रतीक जाधव",
    "विजय गावडे",
    "अनिकेत कदम",
    "शुभम गांवकर",
    "मनीष म्हात्रे",
    "आशिष वीर"
];

export const advisors: string[] = [
    "प्रकाश ब. नाडणकर",
    "नरेश ग. मस्कर",
    "संभाजी ज. नाडणकर",
    "संदीप खडपे",
    "दिलीप बारस्कर",
    "मधुकर जोशी",
    "अरुण वीर",
    "मधुकर शिंदे",
    "तेजस गावडे",
    "चंद्रशेखर मस्कर",
    "सुनील शेट्टे",
    "रविंद्र सातोपे",
    "अशोक सातोपे",
    "शिवराम वीर",
    "बालकृष्ण सातोपे",
    "संतोष परब",
    "हरिश्चंद्र परब",
    "कमलाकर धनावडे",
    "संदीप वीर",
    "जानबा गावडे",
    "जनार्दन कदम"
]

export const generalMembers: string[] = [
    "अमित जाधव",
    "परेश नाडणकर",
    "जगदीश गांवकर",
    "सर्वेश भांडे",
    "मच्छिंद्र शेलार",
    "प्रमोद परब",
    "रविंद्र केळकर",
    "स्वप्नील गांवकर",
    "जितेश गांवकर",
    "अनंत माने",
    "सागर लावंड",
    "दत्ताराम भांडे",
    "मंगेश कातकर",
    "रोशन बेहेरे",
    "सिद्धेश कोलतकर",
    "सचिन जंगम",
    "मनोज जंगम",
    "दत्तकुमार बेहेरे",
    "सचिन घाणेकर",
    "विनोद बेलोशे",
    "रोहित गावडे",
    "विराज उतेकर",
    "रोहित केळकर",
    "नारायण नाडणकर",
    "रमेश गावडे",
    "प्रशांत जंगम",
    "सिद्धेश वीर",
    "बंटी साळूंखे",
    "दयानंद नारकर",
    "सोनू जाधव",
    "प्रविण ओकटे",
    "विनोद शेलार",
    "मनीष म्हात्रे",
    "सौरभ चव्हाण",
    "महेश पाते",
    "अविनाश बनसोडे",
    "समाधान मोहिते",
    "नितीन गुरुव",
    "महेश म्हात्रे",
    "अमित सातोपे",
    "नितेश भोसले",
    "रुपेश भोसले",
    "आबा परब",
    "प्रसाद हुले",
    "तन्मय काते",
    "पांडुरंग कदम",
    "संदीप कदम",
    "अरुण कातकर",
    "नितीन बडे",
    "हनुमंत बडे",
    "पांडुरंग रायकर",
    "सचिन (गोट्या) परब",
    "निमिष बने",
    "सुशांत घाणेकर"
];
