
export type Event = {
  id: string;
  title: string;
  date: string;
  description: string;
  image: string;
  imageHint: string;
};

export type Member = {
  id: string;
  name: string;
  role: string;
  imageUrl: string;
  imageHint: string;
};

export type ExecutiveMember = {
    name: string;
    role: string;
}

export const events: Event[] = [
  {
    id: "1",
    title: "वार्षिक कीर्तन महोत्सव",
    date: "२० ऑगस्ट, २०२४",
    description: "प्रसिद्ध कीर्तनकारांच्या उपस्थितीत भव्य कीर्तन सोहळा.",
    image: "https://picsum.photos/seed/event1/400/250",
    imageHint: "devotional singing"
  },
  {
    id: "2",
    title: "नवरात्री उत्सव",
    date: "३ ऑक्टोबर - १२ ऑक्टोबर, २०२४",
    description: "नऊ दिवसांचा भव्य नवरात्री उत्सव, दररोज विविध धार्मिक कार्यक्रम.",
    image: "https://picsum.photos/seed/event2/400/250",
    imageHint: "navratri festival"
  },
  {
    id: "3",
    title: "महाप्रसाद",
    date: "प्रत्येक शनिवारी",
    description: "दर शनिवारी संध्याकाळी आरतीनंतर महाप्रसादाचे आयोजन.",
    image: "https://picsum.photos/seed/event3/400/250",
    imageHint: "community meal"
  },
  {
    id: "4",
    title: "भूमिपूजन समारंभ",
    date: "२५ डिसेंबर, २०२४",
    description: "मंदिराच्या जिर्णोद्धार कार्याचा शुभारंभ, भूमिपूजन समारंभ.",
    image: "https://picsum.photos/seed/event4/400/250",
    imageHint: "groundbreaking ceremony"
  },
];


export const executiveCommittee: ExecutiveMember[] = [
    { role: "संचालक", name: "विजय कदम"},
    { role: "अध्यक्ष", name: "बबन आमले"},
    { role: "उपाध्यक्ष", name: "सिताराम तानवडे"},
    { role: "सेक्रेटरी", name: "किरण सातवे"},
    { role: "उपसेक्रेटरी", name: "अविनाश सातवे"},
    { role: "खजिनदार", name: "पांडुरंग नाडणकर"},
    { role: "उपखजिनदार", name: "सुशील गांगवकर"},
]

export const members: string[] = [
    "ओंकार बारस्कर",
    "सागर सुकदेव",
    "विठोबा नाडणकर",
    "प्रमोद पाटे",
    "प्रतीक जाधव",
    "विजय गावडे",
    "अनिकेत कदम",
    "शुभम गांगवकर",
    "मनीष म्हात्रे",
    "आशिष वीर"
];

export const advisors: string[] = [
    "प्रकाश ब. नाडणकर",
    "नरेश ग. मस्कर",
    "संभाजी ज. नाडणकर",
    "संदीप खडपे",
    "दिलीप बारस्कर",
    "मधुकर जोशी",
    "अरुण वीर",
    "मधुकर शिंदे",
    "तेजस गावडे",
    "चंद्रशेखर मस्कर",
    "सुनील शेट्टे",
    "रविंद्र सातवे",
    "अशोक सातवे",
    "शिवराम वीर",
    "बालकृष्ण सातवे",
    "संतोष परब",
    "हरिश्चंद्र परब",
    "कमलाकर धवडे",
    "संदीप वीर",
    "जानबा गावडे",
    "जनार्दन कदम"
]

export const generalMembers: string[] = [
    "अमित जाधव",
    "परेश नाडणकर",
    "जगदीश गावकर",
    "सर्वेश भोंडे",
    "मच्छिंद्र शेलार",
    "प्रमोद परब",
    "रविंद्र केळकर",
    "स्वप्नील गावकर",
    "जितेश गावकर",
    "अनंत माने",
    "सागर लावंड",
    "दत्ताराम भोंडे",
    "मंगेश कातकर",
    "रोशन वेटेरे",
    "सिद्धेश कोलतकर",
    "सचिन जंगम",
    "मनोज जंगम",
    "दत्तकुमार वेटेरे",
    "सचिन घाणेकर",
    "विनोद बेलोशे",
    "रोहित गावडे",
    "विराज उतेकर",
    "रोहित केळकर",
    "नारायण नाडणकर",
    "रमेश गावडे",
    "प्रशांत जंगम",
    "सिद्धेश वीर",
    "बंटी सामंतरे",
    "दयानंद नारकर",
    "सोनू जाधव",
    "प्रविण ओकते",
    "विनोद शेलार",
    "मनीष म्हात्रे",
    "सौम्य चव्हाण",
    "महेश पाटे",
    "अविनाश बनसोडे",
    "समाधान मोहिते",
    "नितीन गुज्जर",
    "महेश म्हात्रे",
    "अमित सातवे",
    "नितेश भोसले",
    "रुपेश भोसले",
    "आशा परब",
    "प्रसाद हळे",
    "तन्मय काते",
    "पांडुरंग कदम",
    "संदीप कदम",
    "अरुण कातकर",
    "नितीन वडे",
    "हनुमंत वडे",
    "पांडुरंग रायक्कर",
    "सचिन (जोट्या) परब",
    "निर्मित बने",
    "सुशांत घाणेकर"
];
